const verses = [
  "الرَّبُّ رَاعِيَّ فَلاَ يُعْوِزُنِي شَيْءٌ. (مزمور 23: 1)",
  "ثُمَّ كَلَّمَهُمْ يَسُوعُ أَيْضًا قَائِلًا: «أَنَا هُوَ نُورُ الْعَالَمِ. مَنْ يَتْبَعْنِي فَلاَ يَمْشِي فِي الظُّلْمَةِ بَلْ يَكُونُ لَهُ نُورُ الْحَيَاةِ (يوحنا 8: 12)",
  "وَنَحْنُ نَعْلَمُ أَنَّ كُلَّ الأَشْيَاءِ تَعْمَلُ مَعًا لِلْخَيْرِ لِلَّذِينَ يُحِبُّونَ اللهَ، الَّذِينَ هُمْ مَدْعُوُّونَ حَسَبَ قَصْدِهِ. (رومية 8: 28)",
  "تَعَالَوْا إِلَيَّ يَا جَمِيعَ الْمُتْعَبِينَ وَالثَّقِيلِي الأَحْمَالِ، وَأَنَا أُرِيحُكُمْ. (متى 11: 28)",
  "سَلاَمًا أَتْرُكُ لَكُمْ. سَلاَمِي أُعْطِيكُمْ. لَيْسَ كَمَا يُعْطِي الْعَالَمُ أُعْطِيكُمْ أَنَا. لاَ تَضْطَرِبْ قُلُوبُكُمْ وَلاَ تَرْهَبْ. (يوحنا 14: 27)",
  "طُوبَى لِلأَنْقِيَاءِ الْقَلْبِ، لأَنَّهُمْ يُعَايِنُونَ اللهَ. (متى 5: 8)",
  "اَلرَّبُّ نُورِي وَخَلاَصِي، مِمَّنْ أَخَافُ؟ الرَّبُّ حِصْنُ حَيَاتِي، مِمَّنْ أَرْتَعِبُ؟ (مزمور 27: 1)"
];

// اختيار آية عشوائية
const randomVerse = verses[Math.floor(Math.random() * verses.length)];
document.getElementById("verse").innerText = randomVerse;


// منع الكليك يمين على الصور فقط
document.addEventListener("contextmenu", function(e){
  if (e.target.tagName === "IMG") {
    e.preventDefault();
  }
});
