const verses = [
  "الرَّبُّ رَاعِيَّ فَلاَ يُعْوِزُنِي شَيْءٌ. (مزمور 23: 1)",
  "ثُمَّ كَلَّمَهُمْ يَسُوعُ أَيْضًا قَائِلًا: «أَنَا هُوَ نُورُ الْعَالَمِ. مَنْ يَتْبَعْنِي فَلاَ يَمْشِي فِي الظُّلْمَةِ بَلْ يَكُونُ لَهُ نُورُ الْحَيَاةِ (يوحنا 8: 12)",
  "وَنَحْنُ نَعْلَمُ أَنَّ كُلَّ الأَشْيَاءِ تَعْمَلُ مَعًا لِلْخَيْرِ لِلَّذِينَ يُحِبُّونَ اللهَ، الَّذِينَ هُمْ مَدْعُوُّونَ حَسَبَ قَصْدِهِ. (رومية 8: 28)",
  "تَعَالَوْا إِلَيَّ يَا جَمِيعَ الْمُتْعَبِينَ وَالثَّقِيلِي الأَحْمَالِ، وَأَنَا أُرِيحُكُمْ. (متى 11: 28)",
  "سَلاَمًا أَتْرُكُ لَكُمْ. سَلاَمِي أُعْطِيكُمْ. لَيْسَ كَمَا يُعْطِي الْعَالَمُ أُعْطِيكُمْ أَنَا. لاَ تَضْطَرِبْ قُلُوبُكُمْ وَلاَ تَرْهَبْ. (يوحنا 14: 27)",
  "طُوبَى لِلأَنْقِيَاءِ الْقَلْبِ، لأَنَّهُمْ يُعَايِنُونَ اللهَ. (متى 5: 8)",
  "اَلرَّبُّ نُورِي وَخَلاَصِي، مِمَّنْ أَخَافُ؟ الرَّبُّ حِصْنُ حَيَاتِي، مِمَّنْ أَرْتَعِبُ؟ (مزمور 27: 1)",
  "َلرَّبُّ صَالِحٌ لِلْكُلِّ، وَمَرَاحِمُهُ عَلَى كُلِّ أَعْمَالِهِ.» (مزمور 145: 9)",
  "َذُوقُوا وَانْظُرُوا مَا أَطْيَبَ الرَّبَّ! طُوبَى لِلرَّجُلِ الْمُتَّكِلِ عَلَيْهِ.» (مزمور 34: 8)",
  "َالرَّبُّ يَحْفَظُ خُرُوجَكَ وَدُخُولَكَ مِنَ الآنَ وَإِلَى الدَّهْرِ. (مزمور 121: 8)",
  "َالرَّبُّ لِي فَلاَ أَخَافُ. مَاذَا يَصْنَعُ بِي الإِنْسَانُ؟  (مزمور 118: 6)",
  "الرَّبُّ لِي بَيْنَ مُعِينِيَّ، وَأَنَا سَأَرَى بِأَعْدَائِي.  (مزمور 118: 7)",
  "مِنْ قِبَلِ الرَّبِّ تَتَثَبَّتُ خَطَوَاتُ الإِنْسَانِ وَفِي طَرِيقِهِ يُسَرُّ.  (مزمور 37: 23)",
  "أَلْقِ عَلَى الرَّبِّ هَمَّكَ فَهُوَ يَعُولُكَ. لاَ يَدَعُ الصِّدِّيقَ يَتَزَعْزَعُ إِلَى الأَبَدِ.  (مزمور 55: 22)",
  "صَالِحٌ هُوَ الرَّبُّ. حِصْنٌ فِي يَوْمِ الضَّيقِ، وَهُوَ يَعْرِفُ الْمُتَوَكِّلِينَ عَلَيْهِ.  (ناحوم 1: 7)",
  "يُعْطِي الْمُعْيِيَ قُدْرَةً، وَلِعَدِيمِ الْقُوَّةِ يُكَثِّرُ شِدَّةً.  (إشعياء 40: 29)",
  "وَأَمَّا مُنْتَظِرُو الرَّبِّ فَيُجَدِّدُونَ قُوَّةً. يَرْفَعُونَ أَجْنِحَةً كَالنُّسُورِ. يَرْكُضُونَ وَلاَ يَتْعَبُونَ. يَمْشُونَ وَلاَ يُعْيُونَ.  (إشعياء 40: 31)",
  "الرَّبُّ قَرِيبٌ لِكُلِّ الَّذِينَ يَدْعُونَهُ، الَّذِينَ يَدْعُونَهُ بِالْحَقِّ.  (مزمور 145: 18)",
  "طُوبَى لِلرَّجُلِ الَّذِي جَعَلَ الرَّبَّ مُتَّكَلَهُ، وَلَمْ يَلْتَفِتْ إِلَى الْغَطَارِيسِ وَالْمُنْحَرِفِينَ إِلَى الْكَذِب.  (مزمور 40: 4)",
  "وَيَكُونُ الرَّبُّ مَلْجَأً لِلْمُنْسَحِقِ. مَلْجَأً فِي أَزْمِنَةِ الضِّيقِ.  (مزمور 9: 9)",
  "أَمَّا أَنَا فَعَلَى رَحْمَتِكَ تَوَكَّلْتُ. يَبْتَهِجُ قَلْبِي بِخَلاَصِكَ.  (مزمور 13: 5)",
  "الرَّبُّ عِزِّي وَتُرْسِي. عَلَيْهِ اتَّكَلَ قَلْبِي، فَانْتَصَرْتُ. وَيَبْتَهِجُ قَلْبِي وَبِأُغْنِيَتِي أَحْمَدُهُ.  (مزمور 28: 7)",
  "فِي يَدِكَ آجَالِي. نَجِّنِي مِنْ يَدِ أَعْدَائِي وَمِنَ الَّذِينَ يَطْرُدُونَنِي.  (مزمور 31: 15)",
  "الرَّبُّ فَادِي نُفُوسِ عَبِيدِهِ، وَكُلُّ مَنِ اتَّكَلَ عَلَيْهِ لاَ يُعَاقَبُ.  (مزمور 34: 22)",
  "أُورُشَلِيمُ الْجِبَالُ حَوْلَهَا، وَالرَّبُّ حَوْلَ شَعْبِهِ مِنَ الآنَ وَإِلَى الدَّهْرِ.  (مزمور 125: 2)",
  "يَا رَبُّ، عِزِّي وَحِصْنِي وَمَلْجَإِي فِي يَوْمِ الضِّيِق، إِلَيْكَ تَأْتِي الأُمَمُ مِنْ أَطْرَافِ الأَرْضِ، وَيَقُولُونَ: «إِنَّمَا وَرِثَ آبَاؤُنَا كَذِبًا وَأَبَاطِيلَ وَمَا لاَ مَنْفَعَةَ فِيهِ.  (إرميا 16: 19)",
  "اَلسَّاكِنُ فِي سِتْرِ الْعَلِيِّ، فِي ظِلِّ الْقَدِيرِ يَبِيتُ.  (مزمور 91: 1)",
  "هَلِّلُويَا. طُوبَى لِلرَّجُلِ الْمُتَّقِي الرَّبِّ، الْمَسْرُورِ جِدًّا بِوَصَايَاهُ.  (مزمور 112: 1)",
  "طَيِّبٌ هُوَ الرَّبُّ لِلَّذِينَ يَتَرَجَّوْنَهُ، لِلنَّفْسِ الَّتِي تَطْلُبُهُ.  (مراثي 3: 25)",

];

// اختيار آية عشوائية
const randomVerse = verses[Math.floor(Math.random() * verses.length)];
document.getElementById("verse").innerText = randomVerse;


// منع الكليك يمين على الصور فقط
document.addEventListener("contextmenu", function(e){
  if (e.target.tagName === "IMG") {
    e.preventDefault();
  }
});
